app/controllers/students_controller.rb

    def edit
        @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @student = Student.find_by_id(params[:id])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgen"], ["updated_at", "2021-07-10 00:06:19.950585"], ["id", 1]]